scripts/performance-test-results.txt
Need to install the following packages:
artillery@2.0.33
Ok to proceed? (y) 
npm warn deprecated whatwg-encoding@3.1.1: Use @exodus/bytes instead for a more spec-conformant and faster implementation
Test run id: t4qhb_q376x3yhkzaj4z9deft4xx4nb8d7k_h5he
Phase started: Warm up (index: 0, duration: 30s) 00:30:47(+0530)

--------------------------------------
Metrics for period to: 00:30:50(+0530) (width: 2.001s)
--------------------------------------

http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 5
vusers.created: ................................................................ 5
vusers.created_by_name.Auth and read flow: ..................................... 5


--------------------------------------
Metrics for period to: 00:31:00(+0530) (width: 9.721s)
--------------------------------------

http.codes.200: ................................................................ 80
http.downloaded_bytes: ......................................................... 335163
http.request_rate: ............................................................. 9/sec
http.requests: ................................................................. 83
http.response_time:
  min: ......................................................................... 15
  max: ......................................................................... 5277
  mean: ........................................................................ 1195.3
  median: ...................................................................... 27.9
  p95: ......................................................................... 4867
  p99: ......................................................................... 5272.4
http.response_time.2xx:
  min: ......................................................................... 15
  max: ......................................................................... 5277
  mean: ........................................................................ 1195.3
  median: ...................................................................... 27.9
  p95: ......................................................................... 4867
  p99: ......................................................................... 5272.4
http.responses: ................................................................ 80
vusers.completed: .............................................................. 17
vusers.created: ................................................................ 20
vusers.created_by_name.Auth and read flow: ..................................... 13
vusers.created_by_name.Dashboard data load: .................................... 7
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4160.7
  max: ......................................................................... 8661
  mean: ........................................................................ 5638.9
  median: ...................................................................... 4965.3
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 8692.8


--------------------------------------
Metrics for period to: 00:31:10(+0530) (width: 9.757s)
--------------------------------------

http.codes.200: ................................................................ 93
http.downloaded_bytes: ......................................................... 386886
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 93
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 4265
  mean: ........................................................................ 910.2
  median: ...................................................................... 18
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4231.1
http.response_time.2xx:
  min: ......................................................................... 14
  max: ......................................................................... 4265
  mean: ........................................................................ 910.2
  median: ...................................................................... 18
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4231.1
http.responses: ................................................................ 93
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Auth and read flow: ..................................... 11
vusers.created_by_name.Dashboard data load: .................................... 9
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4146.4
  max: ......................................................................... 4338.9
  mean: ........................................................................ 4244.5
  median: ...................................................................... 4231.1
  p95: ......................................................................... 4316.6
  p99: ......................................................................... 4316.6


Phase completed: Warm up (index: 0, duration: 30s) 00:31:17(+0530)

Phase started: Load test (index: 1, duration: 30s) 00:31:17(+0530)

--------------------------------------
Metrics for period to: 00:31:20(+0530) (width: 9.803s)
--------------------------------------

http.codes.200: ................................................................ 91
http.downloaded_bytes: ......................................................... 373602
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 4248
  mean: ........................................................................ 928.4
  median: ...................................................................... 18
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4231.1
http.response_time.2xx:
  min: ......................................................................... 14
  max: ......................................................................... 4248
  mean: ........................................................................ 928.4
  median: ...................................................................... 18
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4231.1
http.responses: ................................................................ 91
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 29
vusers.created_by_name.Auth and read flow: ..................................... 18
vusers.created_by_name.Dashboard data load: .................................... 11
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4140.4
  max: ......................................................................... 4322.6
  mean: ........................................................................ 4235.8
  median: ...................................................................... 4231.1
  p95: ......................................................................... 4316.6
  p99: ......................................................................... 4316.6


--------------------------------------
Metrics for period to: 00:31:30(+0530) (width: 9.802s)
--------------------------------------

http.codes.200: ................................................................ 208
http.downloaded_bytes: ......................................................... 862191
http.request_rate: ............................................................. 22/sec
http.requests: ................................................................. 213
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 5092
  mean: ........................................................................ 961.3
  median: ...................................................................... 16.9
  p95: ......................................................................... 4676.2
  p99: ......................................................................... 4770.6
http.response_time.2xx:
  min: ......................................................................... 14
  max: ......................................................................... 5092
  mean: ........................................................................ 961.3
  median: ...................................................................... 16.9
  p95: ......................................................................... 4676.2
  p99: ......................................................................... 4770.6
http.responses: ................................................................ 208
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 50
vusers.created_by_name.Auth and read flow: ..................................... 28
vusers.created_by_name.Dashboard data load: .................................... 22
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4004.9
  max: ......................................................................... 5159.8
  mean: ........................................................................ 4454.4
  median: ...................................................................... 4403.8
  p95: ......................................................................... 4867
  p99: ......................................................................... 4965.3


--------------------------------------
Metrics for period to: 00:31:40(+0530) (width: 9.945s)
--------------------------------------

http.codes.200: ................................................................ 237
http.downloaded_bytes: ......................................................... 986904
http.request_rate: ............................................................. 24/sec
http.requests: ................................................................. 237
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 4687
  mean: ........................................................................ 919.2
  median: ...................................................................... 16.9
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 4676.2
http.response_time.2xx:
  min: ......................................................................... 12
  max: ......................................................................... 4687
  mean: ........................................................................ 919.2
  median: ...................................................................... 16.9
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 4676.2
http.responses: ................................................................ 237
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Auth and read flow: ..................................... 38
vusers.created_by_name.Dashboard data load: .................................... 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3944.6
  max: ......................................................................... 4763.3
  mean: ........................................................................ 4284.2
  median: ...................................................................... 4231.1
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6


Phase completed: Load test (index: 1, duration: 30s) 00:31:47(+0530)

--------------------------------------
Metrics for period to: 00:31:50(+0530) (width: 9.945s)
--------------------------------------

http.codes.200: ................................................................ 234
http.downloaded_bytes: ......................................................... 975837
http.request_rate: ............................................................. 22/sec
http.requests: ................................................................. 219
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 4693
  mean: ........................................................................ 910
  median: ...................................................................... 16.9
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4676.2
http.response_time.2xx:
  min: ......................................................................... 12
  max: ......................................................................... 4693
  mean: ........................................................................ 910
  median: ...................................................................... 16.9
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4676.2
http.responses: ................................................................ 234
vusers.completed: .............................................................. 51
vusers.created: ................................................................ 36
vusers.created_by_name.Auth and read flow: ..................................... 22
vusers.created_by_name.Dashboard data load: .................................... 14
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3944
  max: ......................................................................... 4769.9
  mean: ........................................................................ 4268.6
  median: ...................................................................... 4231.1
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6


--------------------------------------
Metrics for period to: 00:32:00(+0530) (width: 1.404s)
--------------------------------------

http.codes.200: ................................................................ 32
http.downloaded_bytes: ......................................................... 131757
http.request_rate: ............................................................. 18/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 4677
  mean: ........................................................................ 933
  median: ...................................................................... 16.9
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4147.4
http.response_time.2xx:
  min: ......................................................................... 14
  max: ......................................................................... 4677
  mean: ........................................................................ 933
  median: ...................................................................... 16.9
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 4147.4
http.responses: ................................................................ 32
vusers.completed: .............................................................. 7
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4133.8
  max: ......................................................................... 4754.8
  mean: ........................................................................ 4277.2
  median: ...................................................................... 4231.1
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 4231.1


All VUs finished. Total time: 1 minute, 5 seconds

--------------------------------
Summary report @ 00:31:52(+0530)
--------------------------------

http.codes.200: ................................................................ 975
http.downloaded_bytes: ......................................................... 4052340
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 975
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 5277
  mean: ........................................................................ 949.1
  median: ...................................................................... 18
  p95: ......................................................................... 4316.6
  p99: ......................................................................... 4867
http.response_time.2xx:
  min: ......................................................................... 12
  max: ......................................................................... 5277
  mean: ........................................................................ 949.1
  median: ...................................................................... 18
  p95: ......................................................................... 4316.6
  p99: ......................................................................... 4867
http.responses: ................................................................ 975
vusers.completed: .............................................................. 210
vusers.created: ................................................................ 210
vusers.created_by_name.Auth and read flow: ..................................... 135
vusers.created_by_name.Dashboard data load: .................................... 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3944
  max: ......................................................................... 8661
  mean: ........................................................................ 4417.9
  median: ...................................................................... 4231.1
  p95: ......................................................................... 4965.3
  p99: ......................................................................... 7260.8
Log file: scripts/artillery-report.json